GopalSaraf/Practicals/PSDL/include/proc/pic18lf55k42.inc
// Register: SPI1INTF
#define SPI1INTF SPI1INTF
SPI1INTF                                 equ 03D1Ah
// bitfield definitions
SPI1INTF_TXUIF_POSN                      equ 0001h
SPI1INTF_TXUIF_POSITION                  equ 0001h
SPI1INTF_TXUIF_SIZE                      equ 0001h
SPI1INTF_TXUIF_LENGTH                    equ 0001h
SPI1INTF_TXUIF_MASK                      equ 0002h
SPI1INTF_RXOIF_POSN                      equ 0002h
SPI1INTF_RXOIF_POSITION                  equ 0002h
SPI1INTF_RXOIF_SIZE                      equ 0001h
SPI1INTF_RXOIF_LENGTH                    equ 0001h
SPI1INTF_RXOIF_MASK                      equ 0004h
SPI1INTF_EOSIF_POSN                      equ 0004h
SPI1INTF_EOSIF_POSITION                  equ 0004h
SPI1INTF_EOSIF_SIZE                      equ 0001h
SPI1INTF_EOSIF_LENGTH                    equ 0001h
SPI1INTF_EOSIF_MASK                      equ 0010h
SPI1INTF_SOSIF_POSN                      equ 0005h
SPI1INTF_SOSIF_POSITION                  equ 0005h
SPI1INTF_SOSIF_SIZE                      equ 0001h
SPI1INTF_SOSIF_LENGTH                    equ 0001h
SPI1INTF_SOSIF_MASK                      equ 0020h
SPI1INTF_TCZIF_POSN                      equ 0006h
SPI1INTF_TCZIF_POSITION                  equ 0006h
SPI1INTF_TCZIF_SIZE                      equ 0001h
SPI1INTF_TCZIF_LENGTH                    equ 0001h
SPI1INTF_TCZIF_MASK                      equ 0040h
SPI1INTF_SRMTIF_POSN                     equ 0007h
SPI1INTF_SRMTIF_POSITION                 equ 0007h
SPI1INTF_SRMTIF_SIZE                     equ 0001h
SPI1INTF_SRMTIF_LENGTH                   equ 0001h
SPI1INTF_SRMTIF_MASK                     equ 0080h
SPI1INTF_SPI1TXUIF_POSN                  equ 0001h
SPI1INTF_SPI1TXUIF_POSITION              equ 0001h
SPI1INTF_SPI1TXUIF_SIZE                  equ 0001h
SPI1INTF_SPI1TXUIF_LENGTH                equ 0001h
SPI1INTF_SPI1TXUIF_MASK                  equ 0002h
SPI1INTF_SPI1RXOIF_POSN                  equ 0002h
SPI1INTF_SPI1RXOIF_POSITION              equ 0002h
SPI1INTF_SPI1RXOIF_SIZE                  equ 0001h
SPI1INTF_SPI1RXOIF_LENGTH                equ 0001h
SPI1INTF_SPI1RXOIF_MASK                  equ 0004h
SPI1INTF_SPI1EOSIF_POSN                  equ 0004h
SPI1INTF_SPI1EOSIF_POSITION              equ 0004h
SPI1INTF_SPI1EOSIF_SIZE                  equ 0001h
SPI1INTF_SPI1EOSIF_LENGTH                equ 0001h
SPI1INTF_SPI1EOSIF_MASK                  equ 0010h
SPI1INTF_SPI1SOSIF_POSN                  equ 0005h
SPI1INTF_SPI1SOSIF_POSITION              equ 0005h
SPI1INTF_SPI1SOSIF_SIZE                  equ 0001h
SPI1INTF_SPI1SOSIF_LENGTH                equ 0001h
SPI1INTF_SPI1SOSIF_MASK                  equ 0020h
SPI1INTF_SPI1TCZIF_POSN                  equ 0006h
SPI1INTF_SPI1TCZIF_POSITION              equ 0006h
SPI1INTF_SPI1TCZIF_SIZE                  equ 0001h
SPI1INTF_SPI1TCZIF_LENGTH                equ 0001h
SPI1INTF_SPI1TCZIF_MASK                  equ 0040h
SPI1INTF_SPI1SRMTIF_POSN                 equ 0007h
SPI1INTF_SPI1SRMTIF_POSITION             equ 0007h
SPI1INTF_SPI1SRMTIF_SIZE                 equ 0001h
SPI1INTF_SPI1SRMTIF_LENGTH               equ 0001h
SPI1INTF_SPI1SRMTIF_MASK                 equ 0080h

// Register: SPI1INTE
#define SPI1INTE SPI1INTE
SPI1INTE                                 equ 03D1Bh
// bitfield definitions
SPI1INTE_TXUIE_POSN                      equ 0001h
SPI1INTE_TXUIE_POSITION                  equ 0001h
SPI1INTE_TXUIE_SIZE                      equ 0001h
SPI1INTE_TXUIE_LENGTH                    equ 0001h
SPI1INTE_TXUIE_MASK                      equ 0002h
SPI1INTE_RXOIE_POSN                      equ 0002h
SPI1INTE_RXOIE_POSITION                  equ 0002h
SPI1INTE_RXOIE_SIZE                      equ 0001h
SPI1INTE_RXOIE_LENGTH                    equ 0001h
SPI1INTE_RXOIE_MASK                      equ 0004h
SPI1INTE_EOSIE_POSN                      equ 0004h
SPI1INTE_EOSIE_POSITION                  equ 0004h
SPI1INTE_EOSIE_SIZE                      equ 0001h
SPI1INTE_EOSIE_LENGTH                    equ 0001h
SPI1INTE_EOSIE_MASK                      equ 0010h
SPI1INTE_SOSIE_POSN                      equ 0005h
SPI1INTE_SOSIE_POSITION                  equ 0005h
SPI1INTE_SOSIE_SIZE                      equ 0001h
SPI1INTE_SOSIE_LENGTH                    equ 0001h
SPI1INTE_SOSIE_MASK                      equ 0020h
SPI1INTE_TCZIE_POSN                      equ 0006h
SPI1INTE_TCZIE_POSITION                  equ 0006h
SPI1INTE_TCZIE_SIZE                      equ 0001h
SPI1INTE_TCZIE_LENGTH                    equ 0001h
SPI1INTE_TCZIE_MASK                      equ 0040h
SPI1INTE_SRMTIE_POSN                     equ 0007h
SPI1INTE_SRMTIE_POSITION                 equ 0007h
SPI1INTE_SRMTIE_SIZE                     equ 0001h
SPI1INTE_SRMTIE_LENGTH                   equ 0001h
SPI1INTE_SRMTIE_MASK                     equ 0080h
SPI1INTE_SPI1TXUIE_POSN                  equ 0001h
SPI1INTE_SPI1TXUIE_POSITION              equ 0001h
SPI1INTE_SPI1TXUIE_SIZE                  equ 0001h
SPI1INTE_SPI1TXUIE_LENGTH                equ 0001h
SPI1INTE_SPI1TXUIE_MASK                  equ 0002h
SPI1INTE_SPI1RXOIE_POSN                  equ 0002h
SPI1INTE_SPI1RXOIE_POSITION              equ 0002h
SPI1INTE_SPI1RXOIE_SIZE                  equ 0001h
SPI1INTE_SPI1RXOIE_LENGTH                equ 0001h
SPI1INTE_SPI1RXOIE_MASK                  equ 0004h
SPI1INTE_SPI1EOSIE_POSN                  equ 0004h
SPI1INTE_SPI1EOSIE_POSITION              equ 0004h
SPI1INTE_SPI1EOSIE_SIZE                  equ 0001h
SPI1INTE_SPI1EOSIE_LENGTH                equ 0001h
SPI1INTE_SPI1EOSIE_MASK                  equ 0010h
SPI1INTE_SPI1SOSIE_POSN                  equ 0005h
SPI1INTE_SPI1SOSIE_POSITION              equ 0005h
SPI1INTE_SPI1SOSIE_SIZE                  equ 0001h
SPI1INTE_SPI1SOSIE_LENGTH                equ 0001h
SPI1INTE_SPI1SOSIE_MASK                  equ 0020h
SPI1INTE_SPI1TCZIE_POSN                  equ 0006h
SPI1INTE_SPI1TCZIE_POSITION              equ 0006h
SPI1INTE_SPI1TCZIE_SIZE                  equ 0001h
SPI1INTE_SPI1TCZIE_LENGTH                equ 0001h
SPI1INTE_SPI1TCZIE_MASK                  equ 0040h
SPI1INTE_SPI1SRMTIE_POSN                 equ 0007h
SPI1INTE_SPI1SRMTIE_POSITION             equ 0007h
SPI1INTE_SPI1SRMTIE_SIZE                 equ 0001h
SPI1INTE_SPI1SRMTIE_LENGTH               equ 0001h
SPI1INTE_SPI1SRMTIE_MASK                 equ 0080h

// Register: SPI1CLK
#define SPI1CLK SPI1CLK
SPI1CLK                                  equ 03D1Ch
// bitfield definitions
SPI1CLK_CLKSEL_POSN                      equ 0000h
SPI1CLK_CLKSEL_POSITION                  equ 0000h
SPI1CLK_CLKSEL_SIZE                      equ 0008h
SPI1CLK_CLKSEL_LENGTH                    equ 0008h
SPI1CLK_CLKSEL_MASK                      equ 00FFh
SPI1CLK_CLKSEL0_POSN                     equ 0000h
SPI1CLK_CLKSEL0_POSITION                 equ 0000h
SPI1CLK_CLKSEL0_SIZE                     equ 0001h
SPI1CLK_CLKSEL0_LENGTH                   equ 0001h
SPI1CLK_CLKSEL0_MASK                     equ 0001h
SPI1CLK_CLKSEL1_POSN                     equ 0001h
SPI1CLK_CLKSEL1_POSITION                 equ 0001h
SPI1CLK_CLKSEL1_SIZE                     equ 0001h
SPI1CLK_CLKSEL1_LENGTH                   equ 0001h
SPI1CLK_CLKSEL1_MASK                     equ 0002h
SPI1CLK_CLKSEL2_POSN                     equ 0002h
SPI1CLK_CLKSEL2_POSITION                 equ 0002h
SPI1CLK_CLKSEL2_SIZE                     equ 0001h
SPI1CLK_CLKSEL2_LENGTH                   equ 0001h
SPI1CLK_CLKSEL2_MASK                     equ 0004h
SPI1CLK_CLKSEL3_POSN                     equ 0003h
SPI1CLK_CLKSEL3_POSITION                 equ 0003h
SPI1CLK_CLKSEL3_SIZE                     equ 0001h
SPI1CLK_CLKSEL3_LENGTH                   equ 0001h
SPI1CLK_CLKSEL3_MASK                     equ 0008h
SPI1CLK_SPI1CLKSEL_POSN                  equ 0000h
SPI1CLK_SPI1CLKSEL_POSITION              equ 0000h
SPI1CLK_SPI1CLKSEL_SIZE                  equ 0008h
SPI1CLK_SPI1CLKSEL_LENGTH                equ 0008h
SPI1CLK_SPI1CLKSEL_MASK                  equ 00FFh
SPI1CLK_SPI1CLKSEL0_POSN                 equ 0000h
SPI1CLK_SPI1CLKSEL0_POSITION             equ 0000h
SPI1CLK_SPI1CLKSEL0_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL0_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL0_MASK                 equ 0001h
SPI1CLK_SPI1CLKSEL1_POSN                 equ 0001h
SPI1CLK_SPI1CLKSEL1_POSITION             equ 0001h
SPI1CLK_SPI1CLKSEL1_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL1_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL1_MASK                 equ 0002h
SPI1CLK_SPI1CLKSEL2_POSN                 equ 0002h
SPI1CLK_SPI1CLKSEL2_POSITION             equ 0002h
SPI1CLK_SPI1CLKSEL2_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL2_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL2_MASK                 equ 0004h
SPI1CLK_SPI1CLKSEL3_POSN                 equ 0003h
SPI1CLK_SPI1CLKSEL3_POSITION             equ 0003h
SPI1CLK_SPI1CLKSEL3_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL3_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL3_MASK                 equ 0008h

// Register: I2C2RXB
#define I2C2RXB I2C2RXB
I2C2RXB                                  equ 03D54h
// bitfield definitions
I2C2RXB_RXB_POSN                         equ 0000h
I2C2RXB_RXB_POSITION                     equ 0000h
I2C2RXB_RXB_SIZE                         equ 0008h
I2C2RXB_RXB_LENGTH                       equ 0008h
I2C2RXB_RXB_MASK                         equ 00FFh

// Register: I2C2TXB
#define I2C2TXB I2C2TXB
I2C2TXB                                  equ 03D55h
// bitfield definitions
I2C2TXB_TXB_POSN                         equ 0000h
I2C2TXB_TXB_POSITION                     equ 0000h
I2C2TXB_TXB_SIZE                         equ 0008h
I2C2TXB_TXB_LENGTH                       equ 0008h
I2C2TXB_TXB_MASK                         equ 00FFh

// Register: I2C2CNT
#define I2C2CNT I2C2CNT
I2C2CNT                                  equ 03D56h
// bitfield definitions
I2C2CNT_CNT_POSN                         equ 0000h
I2C2CNT_CNT_POSITION                     equ 0000h
I2C2CNT_CNT_SIZE                         equ 0008h
I2C2CNT_CNT_LENGTH                       equ 0008h
I2C2CNT_CNT_MASK                         equ 00FFh
I2C2CNT_CNT0_POSN                        equ 0000h
I2C2CNT_CNT0_POSITION                    equ 0000h
I2C2CNT_CNT0_SIZE                        equ 0001h
I2C2CNT_CNT0_LENGTH                      equ 0001h
I2C2CNT_CNT0_MASK                        equ 0001h
I2C2CNT_CNT1_POSN                        equ 0001h
I2C2CNT_CNT1_POSITION                    equ 0001h
I2C2CNT_CNT1_SIZE                        equ 0001h
I2C2CNT_CNT1_LENGTH                      equ 0001h
I2C2CNT_CNT1_MASK                        equ 0002h
I2C2CNT_CNT2_POSN                        equ 0002h
I2C2CNT_CNT2_POSITION                    equ 0002h
I2C2CNT_CNT2_SIZE                        equ 0001h
I2C2CNT_CNT2_LENGTH                      equ 0001h
I2C2CNT_CNT2_MASK                        equ 0004h
I2C2CNT_CNT3_POSN                        equ 0003h
I2C2CNT_CNT3_POSITION                    equ 0003h
I2C2CNT_CNT3_SIZE                        equ 0001h
I2C2CNT_CNT3_LENGTH                      equ 0001h
I2C2CNT_CNT3_MASK                        equ 0008h
I2C2CNT_CNT4_POSN                        equ 0004h
I2C2CNT_CNT4_POSITION                    equ 0004h
I2C2CNT_CNT4_SIZE                        equ 0001h
I2C2CNT_CNT4_LENGTH                      equ 0001h
I2C2CNT_CNT4_MASK                        equ 0010h
I2C2CNT_CNT5_POSN                        equ 0005h
I2C2CNT_CNT5_POSITION                    equ 0005h
I2C2CNT_CNT5_SIZE                        equ 0001h
I2C2CNT_CNT5_LENGTH                      equ 0001h
I2C2CNT_CNT5_MASK                        equ 0020h
I2C2CNT_CNT6_POSN                        equ 0006h
I2C2CNT_CNT6_POSITION                    equ 0006h
I2C2CNT_CNT6_SIZE                        equ 0001h
I2C2CNT_CNT6_LENGTH                      equ 0001h
I2C2CNT_CNT6_MASK                        equ 0040h
I2C2CNT_CNT7_POSN                        equ 0007h
I2C2CNT_CNT7_POSITION                    equ 0007h
I2C2CNT_CNT7_SIZE                        equ 0001h
I2C2CNT_CNT7_LENGTH                      equ 0001h
I2C2CNT_CNT7_MASK                        equ 0080h

// Register: I2C2ADB0
#define I2C2ADB0 I2C2ADB0
I2C2ADB0                                 equ 03D57h
// bitfield definitions
I2C2ADB0_ADB_POSN                        equ 0000h
I2C2ADB0_ADB_POSITION                    equ 0000h
I2C2ADB0_ADB_SIZE                        equ 0008h
I2C2ADB0_ADB_LENGTH                      equ 0008h
I2C2ADB0_ADB_MASK                        equ 00FFh

