GopalSaraf/Practicals/PSDL/include/proc/pic18lf55k42.inc
// Register: PWM8CON
#define PWM8CON PWM8CON
PWM8CON                                  equ 03F62h
// bitfield definitions
PWM8CON_POL_POSN                         equ 0004h
PWM8CON_POL_POSITION                     equ 0004h
PWM8CON_POL_SIZE                         equ 0001h
PWM8CON_POL_LENGTH                       equ 0001h
PWM8CON_POL_MASK                         equ 0010h
PWM8CON_OUT_POSN                         equ 0005h
PWM8CON_OUT_POSITION                     equ 0005h
PWM8CON_OUT_SIZE                         equ 0001h
PWM8CON_OUT_LENGTH                       equ 0001h
PWM8CON_OUT_MASK                         equ 0020h
PWM8CON_EN_POSN                          equ 0007h
PWM8CON_EN_POSITION                      equ 0007h
PWM8CON_EN_SIZE                          equ 0001h
PWM8CON_EN_LENGTH                        equ 0001h
PWM8CON_EN_MASK                          equ 0080h
PWM8CON_PWM8POL_POSN                     equ 0004h
PWM8CON_PWM8POL_POSITION                 equ 0004h
PWM8CON_PWM8POL_SIZE                     equ 0001h
PWM8CON_PWM8POL_LENGTH                   equ 0001h
PWM8CON_PWM8POL_MASK                     equ 0010h
PWM8CON_PWM8OUT_POSN                     equ 0005h
PWM8CON_PWM8OUT_POSITION                 equ 0005h
PWM8CON_PWM8OUT_SIZE                     equ 0001h
PWM8CON_PWM8OUT_LENGTH                   equ 0001h
PWM8CON_PWM8OUT_MASK                     equ 0020h
PWM8CON_PWM8EN_POSN                      equ 0007h
PWM8CON_PWM8EN_POSITION                  equ 0007h
PWM8CON_PWM8EN_SIZE                      equ 0001h
PWM8CON_PWM8EN_LENGTH                    equ 0001h
PWM8CON_PWM8EN_MASK                      equ 0080h

// Register: PWM7DC
#define PWM7DC PWM7DC
PWM7DC                                   equ 03F64h

// Register: PWM7DCL
#define PWM7DCL PWM7DCL
PWM7DCL                                  equ 03F64h
// bitfield definitions
PWM7DCL_DC_POSN                          equ 0006h
PWM7DCL_DC_POSITION                      equ 0006h
PWM7DCL_DC_SIZE                          equ 0002h
PWM7DCL_DC_LENGTH                        equ 0002h
PWM7DCL_DC_MASK                          equ 00C0h
PWM7DCL_DC0_POSN                         equ 0006h
PWM7DCL_DC0_POSITION                     equ 0006h
PWM7DCL_DC0_SIZE                         equ 0001h
PWM7DCL_DC0_LENGTH                       equ 0001h
PWM7DCL_DC0_MASK                         equ 0040h
PWM7DCL_DC1_POSN                         equ 0007h
PWM7DCL_DC1_POSITION                     equ 0007h
PWM7DCL_DC1_SIZE                         equ 0001h
PWM7DCL_DC1_LENGTH                       equ 0001h
PWM7DCL_DC1_MASK                         equ 0080h
PWM7DCL_PWM7DC0_POSN                     equ 0006h
PWM7DCL_PWM7DC0_POSITION                 equ 0006h
PWM7DCL_PWM7DC0_SIZE                     equ 0001h
PWM7DCL_PWM7DC0_LENGTH                   equ 0001h
PWM7DCL_PWM7DC0_MASK                     equ 0040h
PWM7DCL_PWM7DC1_POSN                     equ 0007h
PWM7DCL_PWM7DC1_POSITION                 equ 0007h
PWM7DCL_PWM7DC1_SIZE                     equ 0001h
PWM7DCL_PWM7DC1_LENGTH                   equ 0001h
PWM7DCL_PWM7DC1_MASK                     equ 0080h
PWM7DCL_PWMPW0_POSN                      equ 0006h
PWM7DCL_PWMPW0_POSITION                  equ 0006h
PWM7DCL_PWMPW0_SIZE                      equ 0001h
PWM7DCL_PWMPW0_LENGTH                    equ 0001h
PWM7DCL_PWMPW0_MASK                      equ 0040h
PWM7DCL_PWMPW1_POSN                      equ 0007h
PWM7DCL_PWMPW1_POSITION                  equ 0007h
PWM7DCL_PWMPW1_SIZE                      equ 0001h
PWM7DCL_PWMPW1_LENGTH                    equ 0001h
PWM7DCL_PWMPW1_MASK                      equ 0080h

// Register: PWM7DCH
#define PWM7DCH PWM7DCH
PWM7DCH                                  equ 03F65h
// bitfield definitions
PWM7DCH_DC_POSN                          equ 0000h
PWM7DCH_DC_POSITION                      equ 0000h
PWM7DCH_DC_SIZE                          equ 0008h
PWM7DCH_DC_LENGTH                        equ 0008h
PWM7DCH_DC_MASK                          equ 00FFh
PWM7DCH_DC2_POSN                         equ 0000h
PWM7DCH_DC2_POSITION                     equ 0000h
PWM7DCH_DC2_SIZE                         equ 0001h
PWM7DCH_DC2_LENGTH                       equ 0001h
PWM7DCH_DC2_MASK                         equ 0001h
PWM7DCH_DC3_POSN                         equ 0001h
PWM7DCH_DC3_POSITION                     equ 0001h
PWM7DCH_DC3_SIZE                         equ 0001h
PWM7DCH_DC3_LENGTH                       equ 0001h
PWM7DCH_DC3_MASK                         equ 0002h
PWM7DCH_DC4_POSN                         equ 0002h
PWM7DCH_DC4_POSITION                     equ 0002h
PWM7DCH_DC4_SIZE                         equ 0001h
PWM7DCH_DC4_LENGTH                       equ 0001h
PWM7DCH_DC4_MASK                         equ 0004h
PWM7DCH_DC5_POSN                         equ 0003h
PWM7DCH_DC5_POSITION                     equ 0003h
PWM7DCH_DC5_SIZE                         equ 0001h
PWM7DCH_DC5_LENGTH                       equ 0001h
PWM7DCH_DC5_MASK                         equ 0008h
PWM7DCH_DC6_POSN                         equ 0004h
PWM7DCH_DC6_POSITION                     equ 0004h
PWM7DCH_DC6_SIZE                         equ 0001h
PWM7DCH_DC6_LENGTH                       equ 0001h
PWM7DCH_DC6_MASK                         equ 0010h
PWM7DCH_DC7_POSN                         equ 0005h
PWM7DCH_DC7_POSITION                     equ 0005h
PWM7DCH_DC7_SIZE                         equ 0001h
PWM7DCH_DC7_LENGTH                       equ 0001h
PWM7DCH_DC7_MASK                         equ 0020h
PWM7DCH_DC8_POSN                         equ 0006h
PWM7DCH_DC8_POSITION                     equ 0006h
PWM7DCH_DC8_SIZE                         equ 0001h
PWM7DCH_DC8_LENGTH                       equ 0001h
PWM7DCH_DC8_MASK                         equ 0040h
PWM7DCH_DC9_POSN                         equ 0007h
PWM7DCH_DC9_POSITION                     equ 0007h
PWM7DCH_DC9_SIZE                         equ 0001h
PWM7DCH_DC9_LENGTH                       equ 0001h
PWM7DCH_DC9_MASK                         equ 0080h
PWM7DCH_PWM7DC2_POSN                     equ 0000h
PWM7DCH_PWM7DC2_POSITION                 equ 0000h
PWM7DCH_PWM7DC2_SIZE                     equ 0001h
PWM7DCH_PWM7DC2_LENGTH                   equ 0001h
PWM7DCH_PWM7DC2_MASK                     equ 0001h
PWM7DCH_PWM7DC3_POSN                     equ 0001h
PWM7DCH_PWM7DC3_POSITION                 equ 0001h
PWM7DCH_PWM7DC3_SIZE                     equ 0001h
PWM7DCH_PWM7DC3_LENGTH                   equ 0001h
PWM7DCH_PWM7DC3_MASK                     equ 0002h
PWM7DCH_PWM7DC4_POSN                     equ 0002h
PWM7DCH_PWM7DC4_POSITION                 equ 0002h
PWM7DCH_PWM7DC4_SIZE                     equ 0001h
PWM7DCH_PWM7DC4_LENGTH                   equ 0001h
PWM7DCH_PWM7DC4_MASK                     equ 0004h
PWM7DCH_PWM7DC5_POSN                     equ 0003h
PWM7DCH_PWM7DC5_POSITION                 equ 0003h
PWM7DCH_PWM7DC5_SIZE                     equ 0001h
PWM7DCH_PWM7DC5_LENGTH                   equ 0001h
PWM7DCH_PWM7DC5_MASK                     equ 0008h
PWM7DCH_PWM7DC6_POSN                     equ 0004h
PWM7DCH_PWM7DC6_POSITION                 equ 0004h
PWM7DCH_PWM7DC6_SIZE                     equ 0001h
PWM7DCH_PWM7DC6_LENGTH                   equ 0001h
PWM7DCH_PWM7DC6_MASK                     equ 0010h
PWM7DCH_PWM7DC7_POSN                     equ 0005h
PWM7DCH_PWM7DC7_POSITION                 equ 0005h
PWM7DCH_PWM7DC7_SIZE                     equ 0001h
PWM7DCH_PWM7DC7_LENGTH                   equ 0001h
PWM7DCH_PWM7DC7_MASK                     equ 0020h
PWM7DCH_PWM7DC8_POSN                     equ 0006h
PWM7DCH_PWM7DC8_POSITION                 equ 0006h
PWM7DCH_PWM7DC8_SIZE                     equ 0001h
PWM7DCH_PWM7DC8_LENGTH                   equ 0001h
PWM7DCH_PWM7DC8_MASK                     equ 0040h
PWM7DCH_PWM7DC9_POSN                     equ 0007h
PWM7DCH_PWM7DC9_POSITION                 equ 0007h
PWM7DCH_PWM7DC9_SIZE                     equ 0001h
PWM7DCH_PWM7DC9_LENGTH                   equ 0001h
PWM7DCH_PWM7DC9_MASK                     equ 0080h
PWM7DCH_PWMPW2_POSN                      equ 0000h
PWM7DCH_PWMPW2_POSITION                  equ 0000h
PWM7DCH_PWMPW2_SIZE                      equ 0001h
PWM7DCH_PWMPW2_LENGTH                    equ 0001h
PWM7DCH_PWMPW2_MASK                      equ 0001h
PWM7DCH_PWMPW3_POSN                      equ 0001h
PWM7DCH_PWMPW3_POSITION                  equ 0001h
PWM7DCH_PWMPW3_SIZE                      equ 0001h
PWM7DCH_PWMPW3_LENGTH                    equ 0001h
PWM7DCH_PWMPW3_MASK                      equ 0002h
PWM7DCH_PWMPW4_POSN                      equ 0002h
PWM7DCH_PWMPW4_POSITION                  equ 0002h
PWM7DCH_PWMPW4_SIZE                      equ 0001h
PWM7DCH_PWMPW4_LENGTH                    equ 0001h
PWM7DCH_PWMPW4_MASK                      equ 0004h
PWM7DCH_PWMPW5_POSN                      equ 0003h
PWM7DCH_PWMPW5_POSITION                  equ 0003h
PWM7DCH_PWMPW5_SIZE                      equ 0001h
PWM7DCH_PWMPW5_LENGTH                    equ 0001h
PWM7DCH_PWMPW5_MASK                      equ 0008h
PWM7DCH_PWMPW6_POSN                      equ 0004h
PWM7DCH_PWMPW6_POSITION                  equ 0004h
PWM7DCH_PWMPW6_SIZE                      equ 0001h
PWM7DCH_PWMPW6_LENGTH                    equ 0001h
PWM7DCH_PWMPW6_MASK                      equ 0010h
PWM7DCH_PWMPW7_POSN                      equ 0005h
PWM7DCH_PWMPW7_POSITION                  equ 0005h
PWM7DCH_PWMPW7_SIZE                      equ 0001h
PWM7DCH_PWMPW7_LENGTH                    equ 0001h
PWM7DCH_PWMPW7_MASK                      equ 0020h
PWM7DCH_PWMPW8_POSN                      equ 0006h
PWM7DCH_PWMPW8_POSITION                  equ 0006h
PWM7DCH_PWMPW8_SIZE                      equ 0001h
PWM7DCH_PWMPW8_LENGTH                    equ 0001h
PWM7DCH_PWMPW8_MASK                      equ 0040h
PWM7DCH_PWMPW9_POSN                      equ 0007h
PWM7DCH_PWMPW9_POSITION                  equ 0007h
PWM7DCH_PWMPW9_SIZE                      equ 0001h
PWM7DCH_PWMPW9_LENGTH                    equ 0001h
PWM7DCH_PWMPW9_MASK                      equ 0080h

// Register: PWM7CON
#define PWM7CON PWM7CON
PWM7CON                                  equ 03F66h
// bitfield definitions
PWM7CON_POL_POSN                         equ 0004h
PWM7CON_POL_POSITION                     equ 0004h
PWM7CON_POL_SIZE                         equ 0001h
PWM7CON_POL_LENGTH                       equ 0001h
PWM7CON_POL_MASK                         equ 0010h
PWM7CON_OUT_POSN                         equ 0005h
PWM7CON_OUT_POSITION                     equ 0005h
PWM7CON_OUT_SIZE                         equ 0001h
PWM7CON_OUT_LENGTH                       equ 0001h
PWM7CON_OUT_MASK                         equ 0020h
PWM7CON_EN_POSN                          equ 0007h
PWM7CON_EN_POSITION                      equ 0007h
PWM7CON_EN_SIZE                          equ 0001h
PWM7CON_EN_LENGTH                        equ 0001h
PWM7CON_EN_MASK                          equ 0080h
PWM7CON_PWM7POL_POSN                     equ 0004h
PWM7CON_PWM7POL_POSITION                 equ 0004h
PWM7CON_PWM7POL_SIZE                     equ 0001h
PWM7CON_PWM7POL_LENGTH                   equ 0001h
PWM7CON_PWM7POL_MASK                     equ 0010h
PWM7CON_PWM7OUT_POSN                     equ 0005h
PWM7CON_PWM7OUT_POSITION                 equ 0005h
PWM7CON_PWM7OUT_SIZE                     equ 0001h
PWM7CON_PWM7OUT_LENGTH                   equ 0001h
PWM7CON_PWM7OUT_MASK                     equ 0020h
PWM7CON_PWM7EN_POSN                      equ 0007h
PWM7CON_PWM7EN_POSITION                  equ 0007h
PWM7CON_PWM7EN_SIZE                      equ 0001h
PWM7CON_PWM7EN_LENGTH                    equ 0001h
PWM7CON_PWM7EN_MASK                      equ 0080h

// Register: PWM6DC
#define PWM6DC PWM6DC
PWM6DC                                   equ 03F68h

// Register: PWM6DCL
#define PWM6DCL PWM6DCL
PWM6DCL                                  equ 03F68h
// bitfield definitions
PWM6DCL_DC_POSN                          equ 0006h
PWM6DCL_DC_POSITION                      equ 0006h
PWM6DCL_DC_SIZE                          equ 0002h
PWM6DCL_DC_LENGTH                        equ 0002h
PWM6DCL_DC_MASK                          equ 00C0h
PWM6DCL_DC0_POSN                         equ 0006h
PWM6DCL_DC0_POSITION                     equ 0006h
PWM6DCL_DC0_SIZE                         equ 0001h
PWM6DCL_DC0_LENGTH                       equ 0001h
PWM6DCL_DC0_MASK                         equ 0040h
PWM6DCL_DC1_POSN                         equ 0007h
PWM6DCL_DC1_POSITION                     equ 0007h
PWM6DCL_DC1_SIZE                         equ 0001h
PWM6DCL_DC1_LENGTH                       equ 0001h
PWM6DCL_DC1_MASK                         equ 0080h
PWM6DCL_PWM6DC0_POSN                     equ 0006h
PWM6DCL_PWM6DC0_POSITION                 equ 0006h
PWM6DCL_PWM6DC0_SIZE                     equ 0001h
PWM6DCL_PWM6DC0_LENGTH                   equ 0001h
PWM6DCL_PWM6DC0_MASK                     equ 0040h
PWM6DCL_PWM6DC1_POSN                     equ 0007h
PWM6DCL_PWM6DC1_POSITION                 equ 0007h
PWM6DCL_PWM6DC1_SIZE                     equ 0001h
PWM6DCL_PWM6DC1_LENGTH                   equ 0001h
PWM6DCL_PWM6DC1_MASK                     equ 0080h
PWM6DCL_PWMPW0_POSN                      equ 0006h
PWM6DCL_PWMPW0_POSITION                  equ 0006h
PWM6DCL_PWMPW0_SIZE                      equ 0001h
PWM6DCL_PWMPW0_LENGTH                    equ 0001h
PWM6DCL_PWMPW0_MASK                      equ 0040h
PWM6DCL_PWMPW1_POSN                      equ 0007h
PWM6DCL_PWMPW1_POSITION                  equ 0007h
PWM6DCL_PWMPW1_SIZE                      equ 0001h
PWM6DCL_PWMPW1_LENGTH                    equ 0001h
PWM6DCL_PWMPW1_MASK                      equ 0080h

// Register: PWM6DCH
#define PWM6DCH PWM6DCH
PWM6DCH                                  equ 03F69h
// bitfield definitions
PWM6DCH_DC_POSN                          equ 0000h
PWM6DCH_DC_POSITION                      equ 0000h
PWM6DCH_DC_SIZE                          equ 0008h
PWM6DCH_DC_LENGTH                        equ 0008h
PWM6DCH_DC_MASK                          equ 00FFh
PWM6DCH_DC2_POSN                         equ 0000h
PWM6DCH_DC2_POSITION                     equ 0000h
PWM6DCH_DC2_SIZE                         equ 0001h
PWM6DCH_DC2_LENGTH                       equ 0001h
PWM6DCH_DC2_MASK                         equ 0001h
PWM6DCH_DC3_POSN                         equ 0001h
PWM6DCH_DC3_POSITION                     equ 0001h
PWM6DCH_DC3_SIZE                         equ 0001h
PWM6DCH_DC3_LENGTH                       equ 0001h
PWM6DCH_DC3_MASK                         equ 0002h
PWM6DCH_DC4_POSN                         equ 0002h
PWM6DCH_DC4_POSITION                     equ 0002h
PWM6DCH_DC4_SIZE                         equ 0001h
PWM6DCH_DC4_LENGTH                       equ 0001h
PWM6DCH_DC4_MASK                         equ 0004h
PWM6DCH_DC5_POSN                         equ 0003h
PWM6DCH_DC5_POSITION                     equ 0003h
PWM6DCH_DC5_SIZE                         equ 0001h
PWM6DCH_DC5_LENGTH                       equ 0001h
PWM6DCH_DC5_MASK                         equ 0008h
PWM6DCH_DC6_POSN                         equ 0004h
PWM6DCH_DC6_POSITION                     equ 0004h
PWM6DCH_DC6_SIZE                         equ 0001h
PWM6DCH_DC6_LENGTH                       equ 0001h
PWM6DCH_DC6_MASK                         equ 0010h
PWM6DCH_DC7_POSN                         equ 0005h
PWM6DCH_DC7_POSITION                     equ 0005h
PWM6DCH_DC7_SIZE                         equ 0001h
PWM6DCH_DC7_LENGTH                       equ 0001h
PWM6DCH_DC7_MASK                         equ 0020h
PWM6DCH_DC8_POSN                         equ 0006h
PWM6DCH_DC8_POSITION                     equ 0006h
PWM6DCH_DC8_SIZE                         equ 0001h
PWM6DCH_DC8_LENGTH                       equ 0001h
PWM6DCH_DC8_MASK                         equ 0040h
PWM6DCH_DC9_POSN                         equ 0007h
PWM6DCH_DC9_POSITION                     equ 0007h
PWM6DCH_DC9_SIZE                         equ 0001h
PWM6DCH_DC9_LENGTH                       equ 0001h
PWM6DCH_DC9_MASK                         equ 0080h
PWM6DCH_PWM6DC2_POSN                     equ 0000h
PWM6DCH_PWM6DC2_POSITION                 equ 0000h
PWM6DCH_PWM6DC2_SIZE                     equ 0001h
PWM6DCH_PWM6DC2_LENGTH                   equ 0001h
PWM6DCH_PWM6DC2_MASK                     equ 0001h
PWM6DCH_PWM6DC3_POSN                     equ 0001h
PWM6DCH_PWM6DC3_POSITION                 equ 0001h
PWM6DCH_PWM6DC3_SIZE                     equ 0001h
PWM6DCH_PWM6DC3_LENGTH                   equ 0001h
PWM6DCH_PWM6DC3_MASK                     equ 0002h
PWM6DCH_PWM6DC4_POSN                     equ 0002h
PWM6DCH_PWM6DC4_POSITION                 equ 0002h
PWM6DCH_PWM6DC4_SIZE                     equ 0001h
PWM6DCH_PWM6DC4_LENGTH                   equ 0001h
PWM6DCH_PWM6DC4_MASK                     equ 0004h
PWM6DCH_PWM6DC5_POSN                     equ 0003h
PWM6DCH_PWM6DC5_POSITION                 equ 0003h
PWM6DCH_PWM6DC5_SIZE                     equ 0001h
PWM6DCH_PWM6DC5_LENGTH                   equ 0001h
PWM6DCH_PWM6DC5_MASK                     equ 0008h
PWM6DCH_PWM6DC6_POSN                     equ 0004h
PWM6DCH_PWM6DC6_POSITION                 equ 0004h
PWM6DCH_PWM6DC6_SIZE                     equ 0001h
PWM6DCH_PWM6DC6_LENGTH                   equ 0001h
PWM6DCH_PWM6DC6_MASK                     equ 0010h
PWM6DCH_PWM6DC7_POSN                     equ 0005h
PWM6DCH_PWM6DC7_POSITION                 equ 0005h
PWM6DCH_PWM6DC7_SIZE                     equ 0001h
PWM6DCH_PWM6DC7_LENGTH                   equ 0001h
PWM6DCH_PWM6DC7_MASK                     equ 0020h
PWM6DCH_PWM6DC8_POSN                     equ 0006h
PWM6DCH_PWM6DC8_POSITION                 equ 0006h
PWM6DCH_PWM6DC8_SIZE                     equ 0001h
PWM6DCH_PWM6DC8_LENGTH                   equ 0001h
PWM6DCH_PWM6DC8_MASK                     equ 0040h
PWM6DCH_PWM6DC9_POSN                     equ 0007h
PWM6DCH_PWM6DC9_POSITION                 equ 0007h
PWM6DCH_PWM6DC9_SIZE                     equ 0001h
PWM6DCH_PWM6DC9_LENGTH                   equ 0001h
PWM6DCH_PWM6DC9_MASK                     equ 0080h
PWM6DCH_PWMPW2_POSN                      equ 0000h
PWM6DCH_PWMPW2_POSITION                  equ 0000h
PWM6DCH_PWMPW2_SIZE                      equ 0001h
PWM6DCH_PWMPW2_LENGTH                    equ 0001h
PWM6DCH_PWMPW2_MASK                      equ 0001h
PWM6DCH_PWMPW3_POSN                      equ 0001h
PWM6DCH_PWMPW3_POSITION                  equ 0001h
PWM6DCH_PWMPW3_SIZE                      equ 0001h
PWM6DCH_PWMPW3_LENGTH                    equ 0001h
PWM6DCH_PWMPW3_MASK                      equ 0002h
PWM6DCH_PWMPW4_POSN                      equ 0002h
PWM6DCH_PWMPW4_POSITION                  equ 0002h
PWM6DCH_PWMPW4_SIZE                      equ 0001h
PWM6DCH_PWMPW4_LENGTH                    equ 0001h
PWM6DCH_PWMPW4_MASK                      equ 0004h
PWM6DCH_PWMPW5_POSN                      equ 0003h
PWM6DCH_PWMPW5_POSITION                  equ 0003h
PWM6DCH_PWMPW5_SIZE                      equ 0001h
PWM6DCH_PWMPW5_LENGTH                    equ 0001h
PWM6DCH_PWMPW5_MASK                      equ 0008h
PWM6DCH_PWMPW6_POSN                      equ 0004h
PWM6DCH_PWMPW6_POSITION                  equ 0004h
PWM6DCH_PWMPW6_SIZE                      equ 0001h
PWM6DCH_PWMPW6_LENGTH                    equ 0001h
PWM6DCH_PWMPW6_MASK                      equ 0010h
PWM6DCH_PWMPW7_POSN                      equ 0005h
PWM6DCH_PWMPW7_POSITION                  equ 0005h
PWM6DCH_PWMPW7_SIZE                      equ 0001h
PWM6DCH_PWMPW7_LENGTH                    equ 0001h
PWM6DCH_PWMPW7_MASK                      equ 0020h
PWM6DCH_PWMPW8_POSN                      equ 0006h
PWM6DCH_PWMPW8_POSITION                  equ 0006h
PWM6DCH_PWMPW8_SIZE                      equ 0001h
PWM6DCH_PWMPW8_LENGTH                    equ 0001h
PWM6DCH_PWMPW8_MASK                      equ 0040h
PWM6DCH_PWMPW9_POSN                      equ 0007h
PWM6DCH_PWMPW9_POSITION                  equ 0007h
PWM6DCH_PWMPW9_SIZE                      equ 0001h
PWM6DCH_PWMPW9_LENGTH                    equ 0001h
PWM6DCH_PWMPW9_MASK                      equ 0080h

// Register: PWM6CON
#define PWM6CON PWM6CON
PWM6CON                                  equ 03F6Ah
// bitfield definitions
PWM6CON_POL_POSN                         equ 0004h
PWM6CON_POL_POSITION                     equ 0004h
PWM6CON_POL_SIZE                         equ 0001h
PWM6CON_POL_LENGTH                       equ 0001h
PWM6CON_POL_MASK                         equ 0010h
PWM6CON_OUT_POSN                         equ 0005h
PWM6CON_OUT_POSITION                     equ 0005h
PWM6CON_OUT_SIZE                         equ 0001h
PWM6CON_OUT_LENGTH                       equ 0001h
PWM6CON_OUT_MASK                         equ 0020h
PWM6CON_EN_POSN                          equ 0007h
PWM6CON_EN_POSITION                      equ 0007h
PWM6CON_EN_SIZE                          equ 0001h
PWM6CON_EN_LENGTH                        equ 0001h
PWM6CON_EN_MASK                          equ 0080h
PWM6CON_PWM6POL_POSN                     equ 0004h
PWM6CON_PWM6POL_POSITION                 equ 0004h
PWM6CON_PWM6POL_SIZE                     equ 0001h
PWM6CON_PWM6POL_LENGTH                   equ 0001h
PWM6CON_PWM6POL_MASK                     equ 0010h
PWM6CON_PWM6OUT_POSN                     equ 0005h
PWM6CON_PWM6OUT_POSITION                 equ 0005h
PWM6CON_PWM6OUT_SIZE                     equ 0001h
PWM6CON_PWM6OUT_LENGTH                   equ 0001h
PWM6CON_PWM6OUT_MASK                     equ 0020h
PWM6CON_PWM6EN_POSN                      equ 0007h
PWM6CON_PWM6EN_POSITION                  equ 0007h
PWM6CON_PWM6EN_SIZE                      equ 0001h
PWM6CON_PWM6EN_LENGTH                    equ 0001h
PWM6CON_PWM6EN_MASK                      equ 0080h

