GopalSaraf/Practicals/PSDL/include/proc/pic18lf55k42.inc
#define P8TSEL0                          BANKMASK(CCPTMRS1), 6, b
#define P8TSEL1                          BANKMASK(CCPTMRS1), 7, b
#define PC1IE                            BANKMASK(I2C1PIE), 2, b
#define PC1IF                            BANKMASK(I2C1PIR), 2, b
#define PC2IE                            BANKMASK(I2C2PIE), 2, b
#define PC2IF                            BANKMASK(I2C2PIR), 2, b
#define PCH3                             BANKMASK(ADPCH), 3, b
#define PCH4                             BANKMASK(ADPCH), 4, b
#define PCH5                             BANKMASK(ADPCH), 5, b
#define PFM                              BANKMASK(NCO1CON), 0, b
#define PLEN0                            BANKMASK(CRCCON1), 0, b
#define PLEN1                            BANKMASK(CRCCON1), 1, b
#define PLEN2                            BANKMASK(CRCCON1), 2, b
#define PLEN3                            BANKMASK(CRCCON1), 3, b
#define PLLR                             BANKMASK(OSCSTAT), 0, b
#define POR                              BANKMASK(PCON0), 1, a
#define PPOL                             BANKMASK(ADCON1), 7, b
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0, b
#define PR10                             BANKMASK(SMT1PRH), 2, b
#define PR11                             BANKMASK(SMT1PRH), 3, b
#define PR12                             BANKMASK(SMT1PRH), 4, b
#define PR13                             BANKMASK(SMT1PRH), 5, b
#define PR14                             BANKMASK(SMT1PRH), 6, b
#define PR15                             BANKMASK(SMT1PRH), 7, b
#define PR16                             BANKMASK(SMT1PRU), 0, b
#define PR17                             BANKMASK(SMT1PRU), 1, b
#define PR18                             BANKMASK(SMT1PRU), 2, b
#define PR19                             BANKMASK(SMT1PRU), 3, b
#define PR20                             BANKMASK(SMT1PRU), 4, b
#define PR21                             BANKMASK(SMT1PRU), 5, b
#define PR22                             BANKMASK(SMT1PRU), 6, b
#define PR23                             BANKMASK(SMT1PRU), 7, b
#define PR3                              BANKMASK(SMT1PRL), 3, b
#define PR4                              BANKMASK(SMT1PRL), 4, b
#define PR5                              BANKMASK(SMT1PRL), 5, b
#define PR6                              BANKMASK(SMT1PRL), 6, b
#define PR7                              BANKMASK(SMT1PRL), 7, b
#define PR8                              BANKMASK(SMT1PRH), 0, b
#define PR9                              BANKMASK(SMT1PRH), 1, b
#define PRE0                             BANKMASK(ADPREL), 0, b
#define PRE1                             BANKMASK(ADPREL), 1, b
#define PRE10                            BANKMASK(ADPREH), 2, b
#define PRE11                            BANKMASK(ADPREH), 3, b
#define PRE12                            BANKMASK(ADPREH), 4, b
#define PRE2                             BANKMASK(ADPREL), 2, b
#define PRE3                             BANKMASK(ADPREL), 3, b
#define PRE4                             BANKMASK(ADPREL), 4, b
#define PRE5                             BANKMASK(ADPREL), 5, b
#define PRE6                             BANKMASK(ADPREL), 6, b
#define PRE7                             BANKMASK(ADPREL), 7, b
#define PRE8                             BANKMASK(ADPREH), 0, b
#define PRE9                             BANKMASK(ADPREH), 1, b
#define PREF0                            BANKMASK(ADREF), 0, b
#define PREF1                            BANKMASK(ADREF), 1, b
#define PREV0                            BANKMASK(ADPREVL), 0, b
#define PREV1                            BANKMASK(ADPREVL), 1, b
#define PREV10                           BANKMASK(ADPREVH), 2, b
#define PREV11                           BANKMASK(ADPREVH), 3, b
#define PREV12                           BANKMASK(ADPREVH), 4, b
#define PREV13                           BANKMASK(ADPREVH), 5, b
#define PREV14                           BANKMASK(ADPREVH), 6, b
#define PREV15                           BANKMASK(ADPREVH), 7, b
#define PREV2                            BANKMASK(ADPREVL), 2, b
#define PREV3                            BANKMASK(ADPREVL), 3, b
#define PREV4                            BANKMASK(ADPREVL), 4, b
#define PREV5                            BANKMASK(ADPREVL), 5, b
#define PREV6                            BANKMASK(ADPREVL), 6, b
#define PREV7                            BANKMASK(ADPREVL), 7, b
#define PREV8                            BANKMASK(ADPREVH), 0, b
#define PREV9                            BANKMASK(ADPREVH), 1, b
#define PRLOCKED                         BANKMASK(PRLOCK), 0, b
#define PS0                              BANKMASK(SMT1CON0), 0, b
#define PS1                              BANKMASK(SMT1CON0), 1, b
#define PSCNT0                           BANKMASK(WDTPSL), 0, b
#define PSCNT1                           BANKMASK(WDTPSL), 1, b
#define PSCNT10                          BANKMASK(WDTPSH), 2, b
#define PSCNT11                          BANKMASK(WDTPSH), 3, b
#define PSCNT12                          BANKMASK(WDTPSH), 4, b
#define PSCNT13                          BANKMASK(WDTPSH), 5, b
#define PSCNT14                          BANKMASK(WDTPSH), 6, b
#define PSCNT15                          BANKMASK(WDTPSH), 7, b
#define PSCNT16                          BANKMASK(WDTTMR), 0, b
#define PSCNT17                          BANKMASK(WDTTMR), 1, b
#define PSCNT2                           BANKMASK(WDTPSL), 2, b
#define PSCNT3                           BANKMASK(WDTPSL), 3, b
#define PSCNT4                           BANKMASK(WDTPSL), 4, b
#define PSCNT5                           BANKMASK(WDTPSL), 5, b
#define PSCNT6                           BANKMASK(WDTPSL), 6, b
#define PSCNT7                           BANKMASK(WDTPSL), 7, b
#define PSCNT8                           BANKMASK(WDTPSH), 0, b
#define PSCNT9                           BANKMASK(WDTPSH), 1, b
#define PSIS                             BANKMASK(ADCON2), 7, b
#define PSS0                             BANKMASK(DAC1CON0), 2, b
#define PSS1                             BANKMASK(DAC1CON0), 3, b
#define PWM5DC0                          BANKMASK(PWM5DCL), 6, a
#define PWM5DC1                          BANKMASK(PWM5DCL), 7, a
#define PWM5DC2                          BANKMASK(PWM5DCH), 0, a
#define PWM5DC3                          BANKMASK(PWM5DCH), 1, a
#define PWM5DC4                          BANKMASK(PWM5DCH), 2, a
#define PWM5DC5                          BANKMASK(PWM5DCH), 3, a
#define PWM5DC6                          BANKMASK(PWM5DCH), 4, a
#define PWM5DC7                          BANKMASK(PWM5DCH), 5, a
#define PWM5DC8                          BANKMASK(PWM5DCH), 6, a
#define PWM5DC9                          BANKMASK(PWM5DCH), 7, a
#define PWM5EN                           BANKMASK(PWM5CON), 7, a
#define PWM5MD                           BANKMASK(PMD3), 4, b
#define PWM5OUT                          BANKMASK(PWM5CON), 5, a
#define PWM5POL                          BANKMASK(PWM5CON), 4, a
#define PWM6DC0                          BANKMASK(PWM6DCL), 6, a
#define PWM6DC1                          BANKMASK(PWM6DCL), 7, a
#define PWM6DC2                          BANKMASK(PWM6DCH), 0, a
#define PWM6DC3                          BANKMASK(PWM6DCH), 1, a
#define PWM6DC4                          BANKMASK(PWM6DCH), 2, a
#define PWM6DC5                          BANKMASK(PWM6DCH), 3, a
#define PWM6DC6                          BANKMASK(PWM6DCH), 4, a
#define PWM6DC7                          BANKMASK(PWM6DCH), 5, a
#define PWM6DC8                          BANKMASK(PWM6DCH), 6, a
#define PWM6DC9                          BANKMASK(PWM6DCH), 7, a
#define PWM6EN                           BANKMASK(PWM6CON), 7, a
#define PWM6MD                           BANKMASK(PMD3), 5, b
#define PWM6OUT                          BANKMASK(PWM6CON), 5, a
#define PWM6POL                          BANKMASK(PWM6CON), 4, a
#define PWM7DC0                          BANKMASK(PWM7DCL), 6, a
#define PWM7DC1                          BANKMASK(PWM7DCL), 7, a
#define PWM7DC2                          BANKMASK(PWM7DCH), 0, a
#define PWM7DC3                          BANKMASK(PWM7DCH), 1, a
#define PWM7DC4                          BANKMASK(PWM7DCH), 2, a
#define PWM7DC5                          BANKMASK(PWM7DCH), 3, a
#define PWM7DC6                          BANKMASK(PWM7DCH), 4, a
#define PWM7DC7                          BANKMASK(PWM7DCH), 5, a
#define PWM7DC8                          BANKMASK(PWM7DCH), 6, a
#define PWM7DC9                          BANKMASK(PWM7DCH), 7, a
#define PWM7EN                           BANKMASK(PWM7CON), 7, a
#define PWM7MD                           BANKMASK(PMD3), 6, b
#define PWM7OUT                          BANKMASK(PWM7CON), 5, a
#define PWM7POL                          BANKMASK(PWM7CON), 4, a
#define PWM8DC0                          BANKMASK(PWM8DCL), 6, a
#define PWM8DC1                          BANKMASK(PWM8DCL), 7, a
#define PWM8DC2                          BANKMASK(PWM8DCH), 0, a
#define PWM8DC3                          BANKMASK(PWM8DCH), 1, a
#define PWM8DC4                          BANKMASK(PWM8DCH), 2, a
#define PWM8DC5                          BANKMASK(PWM8DCH), 3, a
#define PWM8DC6                          BANKMASK(PWM8DCH), 4, a
#define PWM8DC7                          BANKMASK(PWM8DCH), 5, a
#define PWM8DC8                          BANKMASK(PWM8DCH), 6, a
#define PWM8DC9                          BANKMASK(PWM8DCH), 7, a
#define PWM8EN                           BANKMASK(PWM8CON), 7, a
#define PWM8MD                           BANKMASK(PMD3), 7, b
#define PWM8OUT                          BANKMASK(PWM8CON), 5, a
#define PWM8POL                          BANKMASK(PWM8CON), 4, a
#define PWS0                             BANKMASK(NCO1CLK), 5, b
#define PWS1                             BANKMASK(NCO1CLK), 6, b
#define PWS2                             BANKMASK(NCO1CLK), 7, b
#define RA0                              BANKMASK(PORTA), 0, a
#define RA0PPS0                          BANKMASK(RA0PPS), 0, b
#define RA0PPS1                          BANKMASK(RA0PPS), 1, b
#define RA0PPS2                          BANKMASK(RA0PPS), 2, b
#define RA0PPS3                          BANKMASK(RA0PPS), 3, b
#define RA0PPS4                          BANKMASK(RA0PPS), 4, b
#define RA0PPS5                          BANKMASK(RA0PPS), 5, b
#define RA1                              BANKMASK(PORTA), 1, a
#define RA1PPS0                          BANKMASK(RA1PPS), 0, b
#define RA1PPS1                          BANKMASK(RA1PPS), 1, b
#define RA1PPS2                          BANKMASK(RA1PPS), 2, b
#define RA1PPS3                          BANKMASK(RA1PPS), 3, b
#define RA1PPS4                          BANKMASK(RA1PPS), 4, b
#define RA1PPS5                          BANKMASK(RA1PPS), 5, b
#define RA2                              BANKMASK(PORTA), 2, a
#define RA2PPS0                          BANKMASK(RA2PPS), 0, b
#define RA2PPS1                          BANKMASK(RA2PPS), 1, b
#define RA2PPS2                          BANKMASK(RA2PPS), 2, b
#define RA2PPS3                          BANKMASK(RA2PPS), 3, b
#define RA2PPS4                          BANKMASK(RA2PPS), 4, b
#define RA2PPS5                          BANKMASK(RA2PPS), 5, b
#define RA3                              BANKMASK(PORTA), 3, a
#define RA3PPS0                          BANKMASK(RA3PPS), 0, b
#define RA3PPS1                          BANKMASK(RA3PPS), 1, b
#define RA3PPS2                          BANKMASK(RA3PPS), 2, b
#define RA3PPS3                          BANKMASK(RA3PPS), 3, b
#define RA3PPS4                          BANKMASK(RA3PPS), 4, b
#define RA3PPS5                          BANKMASK(RA3PPS), 5, b
#define RA4                              BANKMASK(PORTA), 4, a
#define RA4PPS0                          BANKMASK(RA4PPS), 0, b
#define RA4PPS1                          BANKMASK(RA4PPS), 1, b
#define RA4PPS2                          BANKMASK(RA4PPS), 2, b
#define RA4PPS3                          BANKMASK(RA4PPS), 3, b
#define RA4PPS4                          BANKMASK(RA4PPS), 4, b
#define RA4PPS5                          BANKMASK(RA4PPS), 5, b
#define RA5                              BANKMASK(PORTA), 5, a
#define RA5PPS0                          BANKMASK(RA5PPS), 0, b
#define RA5PPS1                          BANKMASK(RA5PPS), 1, b
#define RA5PPS2                          BANKMASK(RA5PPS), 2, b
#define RA5PPS3                          BANKMASK(RA5PPS), 3, b
#define RA5PPS4                          BANKMASK(RA5PPS), 4, b
#define RA5PPS5                          BANKMASK(RA5PPS), 5, b
#define RA6                              BANKMASK(PORTA), 6, a
#define RA6PPS0                          BANKMASK(RA6PPS), 0, b
#define RA6PPS1                          BANKMASK(RA6PPS), 1, b
#define RA6PPS2                          BANKMASK(RA6PPS), 2, b
#define RA6PPS3                          BANKMASK(RA6PPS), 3, b
#define RA6PPS4                          BANKMASK(RA6PPS), 4, b
#define RA6PPS5                          BANKMASK(RA6PPS), 5, b
#define RA7                              BANKMASK(PORTA), 7, a
#define RA7PPS0                          BANKMASK(RA7PPS), 0, b
#define RA7PPS1                          BANKMASK(RA7PPS), 1, b
#define RA7PPS2                          BANKMASK(RA7PPS), 2, b
#define RA7PPS3                          BANKMASK(RA7PPS), 3, b
#define RA7PPS4                          BANKMASK(RA7PPS), 4, b
#define RA7PPS5                          BANKMASK(RA7PPS), 5, b
#define RB0                              BANKMASK(PORTB), 0, a
#define RB0PPS0                          BANKMASK(RB0PPS), 0, b
#define RB0PPS1                          BANKMASK(RB0PPS), 1, b
#define RB0PPS2                          BANKMASK(RB0PPS), 2, b
#define RB0PPS3                          BANKMASK(RB0PPS), 3, b
#define RB0PPS4                          BANKMASK(RB0PPS), 4, b
#define RB0PPS5                          BANKMASK(RB0PPS), 5, b
#define RB1                              BANKMASK(PORTB), 1, a
#define RB1PPS0                          BANKMASK(RB1PPS), 0, b
#define RB1PPS1                          BANKMASK(RB1PPS), 1, b
#define RB1PPS2                          BANKMASK(RB1PPS), 2, b
#define RB1PPS3                          BANKMASK(RB1PPS), 3, b
#define RB1PPS4                          BANKMASK(RB1PPS), 4, b
#define RB1PPS5                          BANKMASK(RB1PPS), 5, b
#define RB2                              BANKMASK(PORTB), 2, a
#define RB2PPS0                          BANKMASK(RB2PPS), 0, b
#define RB2PPS1                          BANKMASK(RB2PPS), 1, b
#define RB2PPS2                          BANKMASK(RB2PPS), 2, b
#define RB2PPS3                          BANKMASK(RB2PPS), 3, b
#define RB2PPS4                          BANKMASK(RB2PPS), 4, b
#define RB2PPS5                          BANKMASK(RB2PPS), 5, b
#define RB3                              BANKMASK(PORTB), 3, a
#define RB3PPS0                          BANKMASK(RB3PPS), 0, b
#define RB3PPS1                          BANKMASK(RB3PPS), 1, b
#define RB3PPS2                          BANKMASK(RB3PPS), 2, b
#define RB3PPS3                          BANKMASK(RB3PPS), 3, b
#define RB3PPS4                          BANKMASK(RB3PPS), 4, b
#define RB3PPS5                          BANKMASK(RB3PPS), 5, b
#define RB4                              BANKMASK(PORTB), 4, a
#define RB4PPS0                          BANKMASK(RB4PPS), 0, b
#define RB4PPS1                          BANKMASK(RB4PPS), 1, b
#define RB4PPS2                          BANKMASK(RB4PPS), 2, b
#define RB4PPS3                          BANKMASK(RB4PPS), 3, b
#define RB4PPS4                          BANKMASK(RB4PPS), 4, b
#define RB4PPS5                          BANKMASK(RB4PPS), 5, b
#define RB5                              BANKMASK(PORTB), 5, a
#define RB5PPS0                          BANKMASK(RB5PPS), 0, b
#define RB5PPS1                          BANKMASK(RB5PPS), 1, b
#define RB5PPS2                          BANKMASK(RB5PPS), 2, b
#define RB5PPS3                          BANKMASK(RB5PPS), 3, b
#define RB5PPS4                          BANKMASK(RB5PPS), 4, b
#define RB5PPS5                          BANKMASK(RB5PPS), 5, b
#define RB6                              BANKMASK(PORTB), 6, a
#define RB6PPS0                          BANKMASK(RB6PPS), 0, b
#define RB6PPS1                          BANKMASK(RB6PPS), 1, b
#define RB6PPS2                          BANKMASK(RB6PPS), 2, b
#define RB6PPS3                          BANKMASK(RB6PPS), 3, b
#define RB6PPS4                          BANKMASK(RB6PPS), 4, b
#define RB6PPS5                          BANKMASK(RB6PPS), 5, b
#define RB7                              BANKMASK(PORTB), 7, a
#define RB7PPS0                          BANKMASK(RB7PPS), 0, b
#define RB7PPS1                          BANKMASK(RB7PPS), 1, b
#define RB7PPS2                          BANKMASK(RB7PPS), 2, b
#define RB7PPS3                          BANKMASK(RB7PPS), 3, b
#define RB7PPS4                          BANKMASK(RB7PPS), 4, b
#define RB7PPS5                          BANKMASK(RB7PPS), 5, b
#define RC0                              BANKMASK(PORTC), 0, a
#define RC0PPS0                          BANKMASK(RC0PPS), 0, b
#define RC0PPS1                          BANKMASK(RC0PPS), 1, b
#define RC0PPS2                          BANKMASK(RC0PPS), 2, b
#define RC0PPS3                          BANKMASK(RC0PPS), 3, b
#define RC0PPS4                          BANKMASK(RC0PPS), 4, b
#define RC0PPS5                          BANKMASK(RC0PPS), 5, b
#define RC1                              BANKMASK(PORTC), 1, a
#define RC1PPS0                          BANKMASK(RC1PPS), 0, b
#define RC1PPS1                          BANKMASK(RC1PPS), 1, b
#define RC1PPS2                          BANKMASK(RC1PPS), 2, b
#define RC1PPS3                          BANKMASK(RC1PPS), 3, b
#define RC1PPS4                          BANKMASK(RC1PPS), 4, b
#define RC1PPS5                          BANKMASK(RC1PPS), 5, b
#define RC2                              BANKMASK(PORTC), 2, a
#define RC2PPS0                          BANKMASK(RC2PPS), 0, b
#define RC2PPS1                          BANKMASK(RC2PPS), 1, b
#define RC2PPS2                          BANKMASK(RC2PPS), 2, b
#define RC2PPS3                          BANKMASK(RC2PPS), 3, b
#define RC2PPS4                          BANKMASK(RC2PPS), 4, b
#define RC2PPS5                          BANKMASK(RC2PPS), 5, b
#define RC3                              BANKMASK(PORTC), 3, a
#define RC3PPS0                          BANKMASK(RC3PPS), 0, b
#define RC3PPS1                          BANKMASK(RC3PPS), 1, b
#define RC3PPS2                          BANKMASK(RC3PPS), 2, b
#define RC3PPS3                          BANKMASK(RC3PPS), 3, b
#define RC3PPS4                          BANKMASK(RC3PPS), 4, b
#define RC3PPS5                          BANKMASK(RC3PPS), 5, b
#define RC4                              BANKMASK(PORTC), 4, a
#define RC4PPS0                          BANKMASK(RC4PPS), 0, b
#define RC4PPS1                          BANKMASK(RC4PPS), 1, b
#define RC4PPS2                          BANKMASK(RC4PPS), 2, b
#define RC4PPS3                          BANKMASK(RC4PPS), 3, b
#define RC4PPS4                          BANKMASK(RC4PPS), 4, b
#define RC4PPS5                          BANKMASK(RC4PPS), 5, b
#define RC5                              BANKMASK(PORTC), 5, a
#define RC5PPS0                          BANKMASK(RC5PPS), 0, b
#define RC5PPS1                          BANKMASK(RC5PPS), 1, b
#define RC5PPS2                          BANKMASK(RC5PPS), 2, b
#define RC5PPS3                          BANKMASK(RC5PPS), 3, b
#define RC5PPS4                          BANKMASK(RC5PPS), 4, b
#define RC5PPS5                          BANKMASK(RC5PPS), 5, b
#define RC6                              BANKMASK(PORTC), 6, a
#define RC6PPS0                          BANKMASK(RC6PPS), 0, b
#define RC6PPS1                          BANKMASK(RC6PPS), 1, b
#define RC6PPS2                          BANKMASK(RC6PPS), 2, b
#define RC6PPS3                          BANKMASK(RC6PPS), 3, b
#define RC6PPS4                          BANKMASK(RC6PPS), 4, b
#define RC6PPS5                          BANKMASK(RC6PPS), 5, b
#define RC7                              BANKMASK(PORTC), 7, a
#define RC7PPS0                          BANKMASK(RC7PPS), 0, b
#define RC7PPS1                          BANKMASK(RC7PPS), 1, b
#define RC7PPS2                          BANKMASK(RC7PPS), 2, b
#define RC7PPS3                          BANKMASK(RC7PPS), 3, b
#define RC7PPS4                          BANKMASK(RC7PPS), 4, b
#define RC7PPS5                          BANKMASK(RC7PPS), 5, b
#define RD                               BANKMASK(NVMCON1), 0, b
#define RD0                              BANKMASK(PORTD), 0, a
#define RD0PPS0                          BANKMASK(RD0PPS), 0, b
#define RD0PPS1                          BANKMASK(RD0PPS), 1, b
#define RD0PPS2                          BANKMASK(RD0PPS), 2, b
#define RD0PPS3                          BANKMASK(RD0PPS), 3, b
#define RD0PPS4                          BANKMASK(RD0PPS), 4, b
#define RD0PPS5                          BANKMASK(RD0PPS), 5, b
#define RD1                              BANKMASK(PORTD), 1, a
#define RD161                            BANKMASK(T1CON), 1, a
#define RD163                            BANKMASK(T3CON), 1, a
#define RD165                            BANKMASK(T5CON), 1, a
#define RD1PPS0                          BANKMASK(RD1PPS), 0, b
#define RD1PPS1                          BANKMASK(RD1PPS), 1, b
#define RD1PPS2                          BANKMASK(RD1PPS), 2, b
#define RD1PPS3                          BANKMASK(RD1PPS), 3, b
#define RD1PPS4                          BANKMASK(RD1PPS), 4, b
#define RD1PPS5                          BANKMASK(RD1PPS), 5, b
#define RD2                              BANKMASK(PORTD), 2, a
#define RD2PPS0                          BANKMASK(RD2PPS), 0, b
#define RD2PPS1                          BANKMASK(RD2PPS), 1, b
#define RD2PPS2                          BANKMASK(RD2PPS), 2, b
#define RD2PPS3                          BANKMASK(RD2PPS), 3, b
#define RD2PPS4                          BANKMASK(RD2PPS), 4, b
#define RD2PPS5                          BANKMASK(RD2PPS), 5, b
#define RD3                              BANKMASK(PORTD), 3, a
#define RD3PPS0                          BANKMASK(RD3PPS), 0, b
#define RD3PPS1                          BANKMASK(RD3PPS), 1, b
#define RD3PPS2                          BANKMASK(RD3PPS), 2, b
#define RD3PPS3                          BANKMASK(RD3PPS), 3, b
#define RD3PPS4                          BANKMASK(RD3PPS), 4, b
#define RD3PPS5                          BANKMASK(RD3PPS), 5, b
#define RD4                              BANKMASK(PORTD), 4, a
#define RD4PPS0                          BANKMASK(RD4PPS), 0, b
#define RD4PPS1                          BANKMASK(RD4PPS), 1, b
#define RD4PPS2                          BANKMASK(RD4PPS), 2, b
#define RD4PPS3                          BANKMASK(RD4PPS), 3, b
#define RD4PPS4                          BANKMASK(RD4PPS), 4, b
#define RD4PPS5                          BANKMASK(RD4PPS), 5, b
#define RD5                              BANKMASK(PORTD), 5, a
#define RD5PPS0                          BANKMASK(RD5PPS), 0, b
#define RD5PPS1                          BANKMASK(RD5PPS), 1, b
#define RD5PPS2                          BANKMASK(RD5PPS), 2, b
#define RD5PPS3                          BANKMASK(RD5PPS), 3, b
#define RD5PPS4                          BANKMASK(RD5PPS), 4, b
#define RD5PPS5                          BANKMASK(RD5PPS), 5, b
#define RD6                              BANKMASK(PORTD), 6, a
#define RD6PPS0                          BANKMASK(RD6PPS), 0, b
#define RD6PPS1                          BANKMASK(RD6PPS), 1, b
#define RD6PPS2                          BANKMASK(RD6PPS), 2, b
#define RD6PPS3                          BANKMASK(RD6PPS), 3, b
#define RD6PPS4                          BANKMASK(RD6PPS), 4, b
